export const productsData: Product[] = [
  {
    id: 1,
    title: 'Мойка для кухни Granula Standard 50х42х19 см врезная кварц белая',
    price: {
      type: 'item',
      gold: 100000,
      retail: 200000
    },
    product_count: 10,
    images: [
      'https://cs.p-static.ru/image/2125615/original-227x227-fit.jpg',
      'https://cs.p-static.ru/image/2023535/original-227x227-fit.jpg',
      'https://cs.p-static.ru/image/2023462/original-227x227-fit.jpg'
    ],
    description: {
      description: 'Предназначена для подвесных унитазов.',
      properties: [
        {
          key: 'Преимущества',
          value: '',
          values: [
            'Стальная рама с антикоррозийным покрытием. ',
            'Расчетная нагрузка до 400 кг. ',
            'Ножки с регулировкой высоты. ',
            'Межосевое расстояние под крепежные шпильки унитаза 18 и 23 см. ',
            'Бачок с функцией шумоподавления. ',
            'Двухрежимная кнопка смыва, надежное гальваническое покрытие. ',
            'Эконом слив – 3 литра, полный слив настраивается от 5,5 до 8,5 литров. ',
            'Монтажный кнопочный узел, полный комплект патрубков, лекала для монтажа отверстий.'
          ]
        },
        {
          key: 'Комплектация',
          value: '',
          values: [
            'унитаз  – санфарфор, сиденье  – полипропилен микролифт;',
            'крепеж для унитаза;',
            'крепежи для рамы;',
            'подсоединения входящей и сливной труб;',
            'сливной патрубок (колено) с адаптером d90/110 мм.'
          ]
        }
      ]
    },
    extended_description: {
      description: 'Предназначена для подвесных унитазов.',
      properties: [
        {
          key: 'Преимущества',
          value: '',
          values: [
            'Стальная рама с антикоррозийным покрытием. ',
            'Расчетная нагрузка до 400 кг. ',
            'Ножки с регулировкой высоты. ',
            'Межосевое расстояние под крепежные шпильки унитаза 18 и 23 см. ',
            'Бачок с функцией шумоподавления. ',
            'Двухрежимная кнопка смыва, надежное гальваническое покрытие. ',
            'Эконом слив – 3 литра, полный слив настраивается от 5,5 до 8,5 литров. ',
            'Монтажный кнопочный узел, полный комплект патрубков, лекала для монтажа отверстий.'
          ]
        },
        {
          key: 'Комплектация',
          value: '',
          values: [
            'унитаз  – санфарфор, сиденье  – полипропилен микролифт;',
            'крепеж для унитаза;',
            'крепежи для рамы;',
            'подсоединения входящей и сливной труб;',
            'сливной патрубок (колено) с адаптером d90/110 мм.'
          ]
        }
      ]
    },
    rating: 4.5,
    reviews_count: 10,
    cover_image: 'https://cs.p-static.ru/image/2125615/original-227x227-fit.jpg',
    properties: [
      {
        title: 'Артикул',
        value: [{ title: '153.741', link: null }]
      },
      {
        title: 'Тип товара',
        value: [{ title: 'Штора', link: '/catalog/957453/?brend=decofest' }]
      },
      {
        title: 'Бренд',
        value: [{ title: 'Decofest', link: '/catalog/957453/?brend=decofest' }]
      },
      {
        title: 'Коллекция',
        value: [{ title: 'Сола', link: '/catalog/957453/?kollekciya=sola' }]
      },
      {
        title: 'Страна-производитель',
        value: [{ title: 'Китай', link: null }]
      },
      {
        title: 'Высота, cm',
        value: [{ title: '280', link: null }]
      }
    ],
    categories: [
      {
        id: 1,
        title: 'Category 1',
        productQty: 10,
        children: []
      }
    ],
    breadcrumbs: [
      {
        id: 1,
        url: 'https://example.com',
        title: 'Товары для дома'
      },
      {
        id: 2,
        url: 'https://example.com',
        title: 'Текстиль для дома'
      },
      {
        id: 3,
        url: 'https://example.com',
        title: 'Постельное белье'
      }
    ]
  },
  {
    id: 2,
    title: 'Керамогранит Axima Brooklyn белый 1200х600х11 мм (2 шт.=1,44 кв.м)',
    product_count: 10,
    rating: null,
    reviews_count: 10,
    description: {
      description: 'Предназначена для подвесных унитазов.',
      properties: [
        {
          key: 'Преимущества',
          value: '',
          values: [
            'Стальная рама с антикоррозийным покрытием. ',
            'Расчетная нагрузка до 400 кг. ',
            'Ножки с регулировкой высоты. ',
            'Межосевое расстояние под крепежные шпильки унитаза 18 и 23 см. ',
            'Бачок с функцией шумоподавления. ',
            'Двухрежимная кнопка смыва, надежное гальваническое покрытие. ',
            'Эконом слив – 3 литра, полный слив настраивается от 5,5 до 8,5 литров. ',
            'Монтажный кнопочный узел, полный комплект патрубков, лекала для монтажа отверстий.'
          ]
        },
        {
          key: 'Комплектация',
          value: '',
          values: [
            'унитаз  – санфарфор, сиденье  – полипропилен микролифт;',
            'крепеж для унитаза;',
            'крепежи для рамы;',
            'подсоединения входящей и сливной труб;',
            'сливной патрубок (колено) с адаптером d90/110 мм.'
          ]
        }
      ]
    },
    extended_description: {
      description: 'Предназначена для подвесных унитазов.',
      properties: [
        {
          key: 'Преимущества',
          value: '',
          values: [
            'Стальная рама с антикоррозийным покрытием. ',
            'Расчетная нагрузка до 400 кг. ',
            'Ножки с регулировкой высоты. ',
            'Межосевое расстояние под крепежные шпильки унитаза 18 и 23 см. ',
            'Бачок с функцией шумоподавления. ',
            'Двухрежимная кнопка смыва, надежное гальваническое покрытие. ',
            'Эконом слив – 3 литра, полный слив настраивается от 5,5 до 8,5 литров. ',
            'Монтажный кнопочный узел, полный комплект патрубков, лекала для монтажа отверстий.'
          ]
        },
        {
          key: 'Комплектация',
          value: '',
          values: [
            'унитаз  – санфарфор, сиденье  – полипропилен микролифт;',
            'крепеж для унитаза;',
            'крепежи для рамы;',
            'подсоединения входящей и сливной труб;',
            'сливной патрубок (колено) с адаптером d90/110 мм.'
          ]
        }
      ]
    },
    price: {
      type: 'item',
      gold: 100000,
      retail: 200000
    },
    images: [
      'https://cs.p-static.ru/image/2125615/original-227x227-fit.jpg',
      'https://cs.p-static.ru/image/2023535/original-227x227-fit.jpg',
      'https://cs.p-static.ru/image/2023462/original-227x227-fit.jpg'
    ],
    cover_image: 'https://cs.p-static.ru/image/2125615/original-227x227-fit.jpg',
    categories: [],
    properties: [],
    breadcrumbs: [
      {
        id: 1,
        url: 'https://example.com',
        title: 'Товары для дома'
      },
      {
        id: 2,
        url: 'https://example.com',
        title: 'Текстиль для дома'
      },
      {
        id: 3,
        url: 'https://example.com',
        title: 'Постельное белье'
      }
    ]
  }
];
